public class Homework1Task2 {
    // Задача 2. Вывод всех четных чисел от 1 до 100
    // Напишите метод printEvenNums, который выведет на экран все четные числа
    // в промежутке от 1 до 100, каждое на новой строке.
    public static void main(String[] args) {
        int n = 100;
        for (int i = 2; i <= n; i += 2) {
            System.out.println(i);

        }
    }
}
